Reports/ТоварныйОтчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Report>
		<Properties>
			<Name>ТоварныйОтчет</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Остатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Порожняя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бронь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыВзаиморасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыВзаиморасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безнал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Терминал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыТовара</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараПродажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТараВозвратная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ПоступлениеТМЦ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СальдоПоТаре</xr:Item>
				<xr:Item>AccumulationRegister.Сальдо</xr:Item>
				<xr:Item>InformationRegister.ИсторияРеквизитов</xr:Item>
				<xr:Item>AccumulationRegister.Остатки</xr:Item>
				<xr:Item>InformationRegister.ЦеныТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомашина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортныеРасходы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоверенности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоСальдо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаБазовая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаБазовая</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПриходная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПриходная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПродажная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Цена</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПродажная</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Сумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ТоварныйОтчет/Ext/ObjectModule.bsl
Процедура Сформировать(ТабДок) Экспорт
	ТабДок.Очистить();

	// Подготовка макета
	Макет = ПолучитьМакет("Основной");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьГруппа = Макет.ПолучитьОбласть("Группа");
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	// ОбластьШапка
	ОбластьШапка.Параметры.НазваниеОрганизации = ПараметрыСеанса.Пользователь.Организация;
	ОбластьШапка.Параметры.Номер = Номер;
	ОбластьШапка.Параметры.МОЛ = СокрЛП(Склад.МОЛ);
	ОбластьШапка.Параметры.Период = ПредставлениеПериода(НачалоДня(Период.ДатаНачала), КонецДня(Период.ДатаОкончания));
	ТабДок.Вывести(ОбластьШапка);
	
	// Начальные остатки
	ВыборкаИтогНаНачало = ПолучитьИтоги(НачалоДня(Период.ДатаНачала), Склад);
	
	ОбластьИтого.Параметры.Надпись = "Остаток на " + Формат(Период.ДатаНачала, "ДФ=dd.MM.yyyy");
	ОбластьИтого.Параметры.СуммаТовара = ВыборкаИтогНаНачало.Сумма;
	ОбластьИтого.Параметры.Сумма = ВыборкаИтогНаНачало.Сумма;
	ТабДок.Вывести(ОбластьИтого);

	// Создание запроса
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата1", НачалоДня(Период.ДатаНачала));
	Запрос.УстановитьПараметр("Дата2", КонецДня(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ссылка.Номер КАК Номер,
	|	Ссылка.Дата КАК Дата,
	|	Ссылка.Контрагент.ПолноеНаименование КАК Контрагент,
	|	Ссылка КАК Документ,
	|	СуммаБазовая КАК СуммаТовара,
	|	СуммаПродажная КАК Сумма
	|ИЗ
	|	Документ.ПоступлениеТМЦ.Товары
	|ГДЕ
	|	Ссылка.Проведен = Истина
	|	И Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Ссылка.Склад.НеВестиУчет = Ложь";
	
	Если НЕ Склад.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И Ссылка.Склад В ИЕРАРХИИ (&Склад)";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|	ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ
	|	Ссылка.Номер КАК Номер,
	|	Ссылка.Дата КАК Дата,
	|	Ссылка.Склад КАК Контрагент,
	|	Ссылка КАК Документ,
	|	СуммаБазовая КАК СуммаТовара,
	|	СуммаОтпускная КАК Сумма
	|ИЗ
	|	Документ.ПеремещениеТМЦ.Товары
	|ГДЕ
	|	Ссылка.Проведен = Истина
	|	И Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Ссылка.СкладПолучатель.НеВестиУчет = Ложь";
	
	Если НЕ Склад.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И Ссылка.СкладПолучатель В ИЕРАРХИИ (&Склад)";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|ИТОГИ
	|	СУММА(СуммаТовара),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ,
	|	Документ";
	
	Результат = Запрос.Выполнить();
	
	// Приходы
	ОбластьГруппа.Параметры.Надпись = "ПРИХОД";
	ТабДок.Вывести(ОбластьГруппа);
	
	ВыборкаИтогПриход = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаИтогПриход.Следующий() Цикл
		ВыборкаДокумент = ВыборкаИтогПриход.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаДокумент.Следующий() Цикл
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДокумент);
			ОбластьСтрока.Параметры.Надпись = ВыборкаДокумент.Контрагент;
			ТабДок.Вывести(ОбластьСтрока);
		КонецЦикла;
	КонецЦикла;
	
	ВыборкаИтогПриход = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаИтогПриход.Следующий();
	
	// Итого по дебету
	ОбластьИтого.Параметры.Заполнить(ВыборкаИтогПриход);
	ОбластьИтого.Параметры.Надпись = "Итого Приход";
	ОбластьИтого.Параметры.СуммаТовара = ВыборкаИтогПриход.СуммаТовара;
	ОбластьИтого.Параметры.Сумма = ВыборкаИтогПриход.Сумма;
	ТабДок.Вывести(ОбластьИтого);
	
	//// Промежуточные остатки
	//ОбластьСтрока.Параметры.Надпись = "Остатки с учетом приходов:";
	//ОбластьСтрока.Параметры.СуммаТовара = ВыборкаИтогПриход.Сумма + ?(ВыборкаИтогПриход.СуммаТовара = Неопределено, 0, ВыборкаИтогПриход.СуммаТовара);
	//ОбластьСтрока.Параметры.Сумма = ВыборкаИтогПриход.Сумма + ?(ВыборкаИтогПриход.СуммаТовара = Неопределено, 0, ВыборкаИтогПриход.СуммаТовара);
	//ТабДок.Вывести(ОбластьСтрока);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ссылка.Номер КАК Номер,
	|	Ссылка.Дата КАК Дата,
	|	Ссылка.Контрагент.ПолноеНаименование КАК Контрагент,
	|	Ссылка КАК Документ,
	|	СуммаБазовая КАК СуммаТовара,
	|	0 КАК СуммаТовараМагазин,
	|	СуммаОтпускная КАК Сумма
	|ИЗ
	|	Документ.РеализацияТМЦ.Товары
	|ГДЕ
	|	Ссылка.Проведен = Истина
	|	И Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Ссылка.ВидРеализации.ТипВзаиморасчета = ЗНАЧЕНИЕ(Перечисление.ТипыВзаиморасчета.Безнал)
	|	И Ссылка.Склад.НеВестиУчет = Ложь";
	
	Если НЕ Склад.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И Ссылка.Склад В ИЕРАРХИИ (&Склад)";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|	ОБЪЕДИНИТЬ ВСЕ ВЫБРАТЬ
	|	Ссылка.Номер КАК Номер,
	|	Ссылка.Дата КАК Дата,
	|	Ссылка.СкладПолучатель КАК Контрагент,
	|	Ссылка КАК Документ,
	|	СуммаБазовая КАК СуммаТовара,
	|	0 КАК СуммаТовараМагазин,
	|	СуммаОтпускная КАК Сумма
	|ИЗ
	|	Документ.ПеремещениеТМЦ.Товары
	|ГДЕ
	|	Ссылка.Проведен = Истина
	|	И Ссылка.Дата МЕЖДУ &Дата1 И &Дата2
	|	И Ссылка.Склад.НеВестиУчет = Ложь";
	
	Если НЕ Склад.Пустая() Тогда
		Запрос.Текст = Запрос.Текст + " И Ссылка.Склад В ИЕРАРХИИ (&Склад)";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|ИТОГИ
	|	СУММА(СуммаТовара),
	|	СУММА(СуммаТовараМагазин),
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ,
	|	Документ";
	
	Результат = Запрос.Выполнить();
	
	// Расходы
	ОбластьГруппа.Параметры.Надпись = "РАСХОД";
	ТабДок.Вывести(ОбластьГруппа);
	
	ВыборкаИтогРасход = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаИтогРасход.Следующий() Цикл
		ВыборкаДокумент = ВыборкаИтогРасход.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
		Пока ВыборкаДокумент.Следующий() Цикл
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДокумент);
			ОбластьСтрока.Параметры.Документ = ВыборкаДокумент.Документ;
			ОбластьСтрока.Параметры.Надпись = ВыборкаДокумент.Контрагент;
			ТабДок.Вывести(ОбластьСтрока);
		КонецЦикла;
	КонецЦикла;
	
	ВыборкаИтогРасход = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ВыборкаИтогРасход.Следующий();
	
	// Итого по кредиту
	ОбластьИтого.Параметры.Заполнить(ВыборкаИтогРасход);
	ОбластьИтого.Параметры.Надпись = "Итого Расход";
	ОбластьИтого.Параметры.СуммаТовара = ВыборкаИтогРасход.СуммаТовара;
	ОбластьИтого.Параметры.Сумма = ВыборкаИтогРасход.Сумма;
	ТабДок.Вывести(ОбластьИтого);
	
	// Конечные остатки
	ВыборкаИтогНаКонец = ПолучитьИтоги(КонецДня(Период.ДатаОкончания), Склад);
	
	ОбластьИтого.Параметры.Надпись = "Остаток на " + Формат(Период.ДатаОкончания, "ДФ=dd.MM.yyyy");
	ОбластьИтого.Параметры.СуммаТовара = ПолучитьЧисло(ВыборкаИтогНаНачало.Сумма) + ПолучитьЧисло(ВыборкаИтогПриход.Сумма) - ПолучитьЧисло(ВыборкаИтогРасход.Сумма);
	ОбластьИтого.Параметры.Сумма = ПолучитьЧисло(ВыборкаИтогНаНачало.Сумма) + ПолучитьЧисло(ВыборкаИтогПриход.Сумма) - ПолучитьЧисло(ВыборкаИтогРасход.Сумма);
	ТабДок.Вывести(ОбластьИтого);
	
	// Подвал
	ТабДок.Вывести(ОбластьПодвал);

	// Показать
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
КонецПроцедуры

Функция ПолучитьИтоги(Дата, Склад) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РегОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.Остатки.Остатки(&Дата, Порожняя = Ложь И Бронь = Ложь) КАК РегОстатки
	|ГДЕ
	|	ИСТИНА
	|	И РегОстатки.Товар.ВидТовара.ТипТовара = ЗНАЧЕНИЕ(Перечисление.ТипыТовара.Товар)
	|	И РегОстатки.Склад.НеВестиУчет = Ложь");
	
	Если ЗначениеЗаполнено(Склад) Тогда
		Запрос.Текст = Запрос.Текст + " И РегОстатки.Склад В ИЕРАРХИИ (&Склад)";
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + "
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	ОБЩИЕ";

	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИтог = РезультатЗапроса.Выбрать();
	ВыборкаИтог.Следующий();
	
	Возврат ВыборкаИтог;
КонецФункции

Функция ПолучитьЧисло(Значение) Экспорт
	Возврат ?(Значение = Неопределено, 0, Значение);
КонецФункции
